In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
data = [4,8,15,16,23,42]
x = pd.Series(data)
print(x)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
elements = [10,20,30,40,50,60,70,80,90,100]
y = pd.Series(elements)
print(y)

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
Name :  Alice  Bob    Claire
Age   :   25   30     27
Gender :Female Male   Female 

Then, print the DataFrame.

In [7]:
data_frame = pd.DataFrame({"name" :["Alice", " Bob","Claire"],
              "age" : [ 25 ,  30  ,   27],
              "Gender" :["Female", "Male" , " Female"] })
data_frame

     name  age   Gender
0   Alice   25   Female
1     Bob   30     Male
2  Claire   27   Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
ans]dataframe is structured table which has intrrelation with other columns too
dataframe is also two dimensional and can contail multiple data types


series on the other hand is one dimensional and should contain single data type only

for example below shown data is a dataframe

In [8]:
data_frame = pd.DataFrame({"name" :["Alice", " Bob","Claire"],
              "age" : [ 25 ,  30  ,   27],
              "Gender" :["Female", "Male" , " Female"] })

In [9]:
data_frame["name"]

0     Alice
1       Bob
2    Claire
Name: name, dtype: object

In [12]:
type(data_frame)

pandas.core.frame.DataFrame

In [13]:
type(data_frame["name"])

pandas.core.series.Series

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
ans]columns,dtypes, rename,drop,

In [18]:
x = pd.read_csv("services.csv")

In [ ]:
here we can change the name of id into first column by following function

In [20]:
x.rename(columns = {"id":"first_column"})
x.head()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
ans]
1.series is not size mutable or immutable
2.dataframe is size mutable
3.panel is mutable

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [21]:
name = pd.Series(["balasaheb","amol","meera"], name='name')
middle_name = pd.Series(["govind","mahadev","pandurang"], name='middle_name')
surname  = pd.Series(["bhosale","jadhav","shinde"],name='surname')
age = pd.Series([22,24,26],name='age')
df=pd.concat([name,middle_name,surname,age],axis=1)
df

        name middle_name  surname  age
0  balasaheb      govind  bhosale   22
1       amol     mahadev   jadhav   24
2      meera   pandurang   shinde   26

In [ ]:
we create a series like above four in number each having title annd same number of data
then we apply concat operation on all series